package org.openyu.socklet.core.net.socklet;

import org.openyu.socklet.message.vo.ModuleType;

/**
 * 模組,測試用
 * 
 * 1=系統用
 * 
 * 2=子功能用
 */
public enum CoreModuleType implements ModuleType
{
	//---------------------------------------------------
	// reservation 100-109=10
	//---------------------------------------------------

	//---------------------------------------------------
	// spec server 110-119=10
	//---------------------------------------------------
	/**
	 * 帳戶account
	 */
	ACCOUNT(110000),

	/**
	 * 登陸login
	 */
	LOGIN(111000),

	//---------------------------------------------------
	//master 120-149=30
	//---------------------------------------------------
	/**
	 * 社團,盟,公會master
	 */
	LEAGUE(120000),

	/**
	 * 活動master
	 */
	ACTIVITY(121000),

	/**
	 * 博物館(排行統計)master
	 */
	MUSEUM(122000),

	//---------------------------------------------------
	//slave 150-198=49
	//---------------------------------------------------
	/**
	 * 核心slave
	 */
	CORE(150000),

	/**
	 * 角色(等級,金幣,經驗...)slave
	 */
	ROLE(151000),

	/**
	 * 聊天slave
	 */
	CHAT(152000),

	/**
	 * 郵件slave
	 */
	MAIL(153000),

	/**
	 * 世界(玩家進入,放怪...)
	 */
	WORLD(154000),

	/**
	 * 組隊slave
	 */
	TEAM(155000),

	/**
	 * 任務slave
	 */
	QUEST(156000),

	/**
	 * 出名slave
	 */
	WELL_KNOWN(157000),

	/**
	 * 成就slave
	 */
	EFFORT(158000),

	//---------------------------------------------------
	/**
	 * 客戶端用
	 */
	CLIENT(199000),

	//---------------------------------------------------
	// 子功能開發
	//---------------------------------------------------
	/**
	 * 四象轉生slave
	 */
	FOUR_SYMBOL(210000),

	/**
	 * 卜卦slave
	 */
	DIVINATION(211000),

	/**
	 * 神秘商店slave
	 */
	MYSTIC_SHOP(212000),
	//---------------------------------------------------
	;

	private final int intValue;

	private CoreModuleType(int intValue)
	{
		this.intValue = intValue;
	}

	public int getValue()
	{
		return intValue;
	}
}
